wkcwkc/cc3200_httpserver/main.c
		//Ip Acquired Event Data
		pEventData = &pNetAppEvent->EventData.ipAcquiredV4;
		g_uiIpAddress = pEventData->ip;

		//Gateway IP address
		g_ulGatewayIP = pEventData->gateway;

		/*UART_PRINT("[NETAPP EVENT] IP Acquired: IP=%d.%d.%d.%d , "
		 "Gateway=%d.%d.%d.%d\n\r",
		 SL_IPV4_BYTE(pNetAppEvent->EventData.ipAcquiredV4.ip,3),
		 SL_IPV4_BYTE(pNetAppEvent->EventData.ipAcquiredV4.ip,2),
		 SL_IPV4_BYTE(pNetAppEvent->EventData.ipAcquiredV4.ip,1),
		 SL_IPV4_BYTE(pNetAppEvent->EventData.ipAcquiredV4.ip,0),
		 SL_IPV4_BYTE(pNetAppEvent->EventData.ipAcquiredV4.gateway,3),
		 SL_IPV4_BYTE(pNetAppEvent->EventData.ipAcquiredV4.gateway,2),
		 SL_IPV4_BYTE(pNetAppEvent->EventData.ipAcquiredV4.gateway,1),
		 SL_IPV4_BYTE(pNetAppEvent->EventData.ipAcquiredV4.gateway,0));
		 */
	}
		break;

	case SL_NETAPP_IP_LEASED_EVENT: {
		SET_STATUS_BIT(g_ulStatus, STATUS_BIT_IP_LEASED);

		//
		// Information about the IP-Leased details(like IP-Leased,lease-time,
		// mac etc) will be available in 'SlIpLeasedAsync_t' - Applications
		// can use it if required
		//
		// SlIpLeasedAsync_t *pEventData = NULL;
		// pEventData = &pNetAppEvent->EventData.ipLeased;
		//

	}
		break;

	case SL_NETAPP_IP_RELEASED_EVENT: {
		CLR_STATUS_BIT(g_ulStatus, STATUS_BIT_IP_LEASED);

		//
		// Information about the IP-Released details (like IP-address, mac
		// etc) will be available in 'SlIpReleasedAsync_t' - Applications
		// can use it if required
		//
		// SlIpReleasedAsync_t *pEventData = NULL;
		// pEventData = &pNetAppEvent->EventData.ipReleased;
		//
	}
		break;

	default: {
		UART_PRINT("[NETAPP EVENT] Unexpected event [0x%x] \n\r",
				pNetAppEvent->Event);
	}
		break;
	}
}

//*****************************************************************************
//
//! This function handles socket events indication
//!
//! \param[in]      pSock - Pointer to Socket Event Info
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkSockEventHandler(SlSockEvent_t *pSock) {
	//
	// This application doesn't work w/ socket - Events are not expected
	//

}

//*****************************************************************************
//
//! This function gets triggered when HTTP Server receives Application
//! defined GET and POST HTTP Tokens.
//!
//! \param pHttpServerEvent Pointer indicating http server event
//! \param pHttpServerResponse Pointer indicating http server response
//!
//! \return None
//!
//*****************************************************************************


void SimpleLinkHttpServerCallback(SlHttpServerEvent_t *pSlHttpServerEvent,
		SlHttpServerResponse_t *pSlHttpServerResponse) {
	unsigned char strLenVal = 0;

	if (!pSlHttpServerEvent || !pSlHttpServerResponse) {
		return;
	}

	switch (pSlHttpServerEvent->Event) {
	case SL_NETAPP_HTTPGETTOKENVALUE_EVENT: {
		unsigned char status, *ptr;

		ptr = pSlHttpServerResponse->ResponseData.token_value.data;
		pSlHttpServerResponse->ResponseData.token_value.len = 0;

		if (memcmp(pSlHttpServerEvent->EventData.httpTokenName.data,
				"__SL_G_LOG", strlen("__SL_G_LOG")) == 0) {
			switch (loginstate) {
			case STATELOADLIST: {
				loginstate = STATEINIT;
				UART_PRINT("get2 \r\n");
				break;
			}
			case STATELOGINSUCCESS: {
				strLenVal = strlen("LOGIN_OK");
				memcpy(ptr, "LOGIN_OK", strLenVal);
				pSlHttpServerResponse->ResponseData.token_value.len +=
						strLenVal;
				loginstate = STATELOADLIST;
				UART_PRINT("get1 \r\n");
				break;
			}
			case STATELOGINFAIL: {
				loginstate = STATEINIT;
				strLenVal = strlen("LOGIN_FAIL");
				memcpy(ptr, "LOGIN_FAIL", strLenVal);
				pSlHttpServerResponse->ResponseData.token_value.len +=
						strLenVal;
				UART_PRINT("get3 \r\n");
				break;
			}
			}

		}
		if (memcmp(pSlHttpServerEvent->EventData.httpTokenName.data,
				"__SL_G_LOL", strlen("__SL_G_LOL")) == 0) {
			if (loginstate == STATELOADLIST) {
				strLenVal = strlen("LOGIN_OK");
				memcpy(ptr, "LOGIN_OK", strLenVal);
				pSlHttpServerResponse->ResponseData.token_value.len +=
						strLenVal;
				loginstate = STATELOADLIST;
				UART_PRINT("get4 \r\n");
			}
		}

		if (memcmp(pSlHttpServerEvent->EventData.httpTokenName.data,
						"__SL_G_PWM", strlen("__SL_G_PWM")) == 0) {
			if (loginstate == STATELOADLIST) {
				char str_pwm_count[4]={'\0','\0','\0','\0'};

				ltoa(pwm_count,str_pwm_count);
				strLenVal = strlen(str_pwm_count);
				memcpy(ptr, str_pwm_count, strLenVal);
				pSlHttpServerResponse->ResponseData.token_value.len +=strLenVal;
				loginstate = STATELOADLIST;
				UART_PRINT("get5 \r\n");

			}

		}
		if (memcmp(pSlHttpServerEvent->EventData.httpTokenName.data,
						"__SL_G_ADC", strlen("__SL_G_ADC")) == 0) {
			if (loginstate == STATELOADLIST) {
				char str_adc_vol[12]={'\0','\0','\0','\0','\0','\0','\0','\0','\0','\0','\0','\0'};

				sprintf(str_adc_vol,"%f",GetADCVoltage());
				strLenVal = strlen(str_adc_vol);
				memcpy(ptr, str_adc_vol, strLenVal);
				pSlHttpServerResponse->ResponseData.token_value.len +=strLenVal;
				loginstate = STATELOADLIST;
				UART_PRINT("get6 \r\n");

			}

		}

		if (memcmp(pSlHttpServerEvent->EventData.httpTokenName.data,
								"__SL_G_ACC", strlen("__SL_G_ACC")) == 0) {
					if (loginstate == STATELOADLIST) {
						char str_acc[30];
						int ii;
						for(ii=0;ii<30;ii++)
							str_acc[ii]='\0';
						Get_acc_data();
						sprintf(str_acc,"X: %d Y: %d Z: %d",acc_data[0],acc_data[1],acc_data[2]);
						strLenVal = strlen(str_acc);
						memcpy(ptr, str_acc, strLenVal);
						pSlHttpServerResponse->ResponseData.token_value.len +=strLenVal;
						loginstate = STATELOADLIST;
						UART_PRINT("get7 \r\n");

					}

				}

	}
		break;

	case SL_NETAPP_HTTPPOSTTOKENVALUE_EVENT: {
		unsigned char *ptr =
				pSlHttpServerEvent->EventData.httpPostData.token_name.data;
		unsigned char tokenValueLen =
				pSlHttpServerEvent->EventData.httpPostData.token_value.len;

		UART_PRINT("tokenName %s\r\n", ptr);
		if (memcmp(ptr, "__SL_P_LNA", strlen("__SL_P_LNA")) == 0) {
			ptr = pSlHttpServerEvent->EventData.httpPostData.token_value.data;

