wkcwkc/cc3200_httpserver/main.c
		}

		//Stop Internal HTTP Server
		lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR(lRetVal);

		//Start Internal HTTP Server
		lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR(lRetVal);

		char iCount = 0;
		//Read the AP SSID
		memset(ucAPSSID, '\0', AP_SSID_LEN_MAX);
		len = AP_SSID_LEN_MAX;
		config_opt = WLAN_AP_OPT_SSID;
		lRetVal = sl_WlanGet(SL_WLAN_CFG_AP_ID, &config_opt, &len,
				(unsigned char*) ucAPSSID);
		ASSERT_ON_ERROR(lRetVal);

		Report("\n\rDevice is in AP Mode, Please Connect to AP [%s] and"
				"type [mysimplelink.net] in the browser \n\r", ucAPSSID);

		//Blink LED 3 times to Indicate AP Mode
		for (iCount = 0; iCount < 3; iCount++) {
			//Turn RED LED On
			//GPIO_IF_LedOn(MCU_RED_LED_GPIO);
			osi_Sleep(400);

			//Turn RED LED Off
			//GPIO_IF_LedOff(MCU_RED_LED_GPIO);
			osi_Sleep(400);
		}

	} else {
		//Stop Internal HTTP Server
		lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR(lRetVal);

		//Start Internal HTTP Server
		lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
		ASSERT_ON_ERROR(lRetVal);

		//waiting for the device to Auto Connect
		while ((!IS_IP_ACQUIRED(g_ulStatus))
				&& g_ucConnectTimeout < AUTO_CONNECTION_TIMEOUT_COUNT) {
			//Turn RED LED On
			//GPIO_IF_LedOn(MCU_RED_LED_GPIO);
			osi_Sleep(50);

			//Turn RED LED Off
			//GPIO_IF_LedOff(MCU_RED_LED_GPIO);
			osi_Sleep(50);

			g_ucConnectTimeout++;
		}
		//Couldn't connect Using Auto Profile
		if (g_ucConnectTimeout == AUTO_CONNECTION_TIMEOUT_COUNT) {
			//Blink Red LED to Indicate Connection Error
			//GPIO_IF_LedOn(MCU_RED_LED_GPIO);

			CLR_STATUS_BIT_ALL(g_ulStatus);

			Report("Use Smart Config Application to configure the device.\n\r");
			//Connect Using Smart Config
			lRetVal = SmartConfigConnect();
			ASSERT_ON_ERROR(lRetVal);

			//Waiting for the device to Auto Connect
			while (!IS_IP_ACQUIRED(g_ulStatus)) {
				MAP_UtilsDelay(500);
			}

		}
		//Turn RED LED Off
		//GPIO_IF_LedOff(MCU_RED_LED_GPIO);
		UART_PRINT("\n\rDevice is in STA Mode, Connect to the AP[%s] and type"
				"IP address [%d.%d.%d.%d] in the browser \n\r",
				g_ucConnectionSSID, SL_IPV4_BYTE(g_uiIpAddress, 3),
				SL_IPV4_BYTE(g_uiIpAddress, 2), SL_IPV4_BYTE(g_uiIpAddress, 1),
				SL_IPV4_BYTE(g_uiIpAddress, 0));

	}
	return SUCCESS;
}

//****************************************************************************
//
//!    \brief Read Force AP GPIO and Configure Mode - 1(Access Point Mode)
//!                                                  - 0 (Station Mode)
//!
//! \return                        None
//
//****************************************************************************
static void ReadDeviceConfiguration() {
	unsigned int uiGPIOPort;
	unsigned char pucGPIOPin;
	unsigned char ucPinValue;

	//Read GPIO
	GPIO_IF_GetPortNPin(SH_GPIO_3, &uiGPIOPort, &pucGPIOPin);
	ucPinValue = GPIO_IF_Get(SH_GPIO_3, uiGPIOPort, pucGPIOPin);

	//If Connected to VCC, Mode is AP
	if (ucPinValue == 1) {
		//AP Mode
		g_uiDeviceModeConfig = ROLE_AP;
	} else {
		//STA Mode
		g_uiDeviceModeConfig = ROLE_STA;
	}

}

//****************************************************************************
//
//!  \brief                     Handles HTTP Server Task
//!                                              
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void HTTPServerTask(void *pvParameters) {
	long lRetVal = -1;
	InitializeAppVariables();

	//
	// Following function configure the device to default state by cleaning
	// the persistent settings stored in NVMEM (viz. connection profiles &
	// policies, power policy etc)
	//
	// Applications may choose to skip this step if the developer is sure
	// that the device is in its default state at start of applicaton
	//
	// Note that all profiles and persistent settings that were done on the
	// device will be lost
	//
	lRetVal = ConfigureSimpleLinkToDefaultState();
	if (lRetVal < 0) {
		if (DEVICE_NOT_IN_STATION_MODE == lRetVal)
			UART_PRINT(
					"Failed to configure the device in its default state\n\r");

		LOOP_FOREVER()
		;
	}

	UART_PRINT("Device is configured in default state \n\r");

	memset(g_ucSSID, '\0', AP_SSID_LEN_MAX);

	//Read Device Mode Configuration
	ReadDeviceConfiguration();

	//Connect to Network
	lRetVal = ConnectToNetwork();

	//Stop Internal HTTP Server
	lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
	if (lRetVal < 0) {
		ERR_PRINT(lRetVal);
		LOOP_FOREVER()
		;
	}

	//Start Internal HTTP Server
	lRetVal = sl_NetAppStart(SL_NET_APP_HTTP_SERVER_ID);
	if (lRetVal < 0) {
		ERR_PRINT(lRetVal);
		LOOP_FOREVER()
		;
	}

	//Handle Async Events
	while (1) {

	}
}
//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void DisplayBanner(char * AppName) {

	Report("\n\n\n\r");
	Report("\t\t *************************************************\n\r");
	Report("\t\t      CC3200 %s Application       \n\r", AppName);
	Report("\t\t *************************************************\n\r");
	Report("\n\n\n\r");
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void BoardInit(void) {
	/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
	//
	// Set vector table base
	//
#if defined(ccs)
	MAP_IntVTableBaseSet((unsigned long) &g_pfnVectors[0]);
#endif
#if defined(ewarm)
	MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif
	//
	// Enable Processor
	//
	MAP_IntMasterEnable();
	MAP_IntEnable(FAULT_SYSTICK);

	PRCMCC3200MCUInit();
}

//****************************************************************************
//                            MAIN FUNCTION
//****************************************************************************
void main() {
	long lRetVal = -1;

	//Board Initialization
	BoardInit();

	//Pin Configuration
	PinMuxConfig();

	InitPWMModules();
	InitADCModules();
	I2C_IF_Open(I2C_MASTER_MODE_FST);

	//Change Pin 58 Configuration from Default to Pull Down
	MAP_PinConfigSet(PIN_58, PIN_STRENGTH_2MA | PIN_STRENGTH_4MA,
	PIN_TYPE_STD_PD);


	//UART Initialization
	MAP_PRCMPeripheralReset(PRCM_UARTA0);

	MAP_UARTConfigSetExpClk(CONSOLE, MAP_PRCMPeripheralClockGet(CONSOLE_PERIPH),
	UART_BAUD_RATE, (UART_CONFIG_WLEN_8 |
	UART_CONFIG_STOP_ONE | UART_CONFIG_PAR_NONE));

	//Display Application Banner on UART Terminal
	DisplayBanner(APPLICATION_NAME);

	//
	// Simplelinkspawntask
	//
	lRetVal = VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
	if (lRetVal < 0) {
		UART_PRINT("Unable to start simpelink spawn task\n\r");
		LOOP_FOREVER()
		;
	}
	//
	// Create HTTP Server Task
	//
	lRetVal = osi_TaskCreate(HTTPServerTask, (signed char*) "HTTPServerTask",
	OSI_STACK_SIZE, NULL, OOB_TASK_PRIORITY, NULL);
	if (lRetVal < 0) {
		UART_PRINT("Unable to create task\n\r");
		LOOP_FOREVER()
		;
	}

	//
	// Start OS Scheduler
	//


	UpdateDutyCycle(TIMERA2_BASE, TIMER_B, pwm_count);
	UART_PRINT("%f\r\n",GetADCVoltage());



	Get_acc_data();
	UART_PRINT("%d  %d  %d\r\n",acc_data[0],acc_data[1],acc_data[2]);


	osi_start();

	while (1) {

	}

}
